# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Users\ailen\OneDrive\Documents\PSoC Creator\Workspace01\CapSenseDesign_freeRTOS.cydsn\CapSenseDesign_freeRTOS.cyprj
# Date: Thu, 30 Nov 2023 20:35:51 GMT
#set_units -time ns
create_clock -name {CyILO} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/ilo}]]
create_clock -name {CyClk_LF} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/lfclk}]]
create_clock -name {CyFLL} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/fll}]]
create_clock -name {CyClk_HF0} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/hfclk_0}]]
create_clock -name {CyClk_Fast} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/fastclk}]]
create_clock -name {CyClk_Peri} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/periclk}]]
create_generated_clock -name {CyClk_Slow} -source [get_pins {ClockBlock/periclk}] -edges {1 2 3} [list [get_pins {ClockBlock/slowclk}]]
create_generated_clock -name {CapSense_ModClk} -source [get_pins {ClockBlock/periclk}] -edges {1 255 511} [list [get_pins {ClockBlock/ff_div_43}]]
create_generated_clock -name {DEBUG_UART_SCBCLK} -source [get_pins {ClockBlock/periclk}] -edges {1 53 105} -nominal_period 1083.3333333333333 [list [get_pins {ClockBlock/ff_div_5}]]
create_generated_clock -name {Clock_1} -source [get_pins {ClockBlock/periclk}] -edges {1 49 97} [list [get_pins {ClockBlock/ff_div_20}]]
create_clock -name {CyPeriClk_App} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/periclk_App}]]
create_clock -name {CyIMO} -period 125 -waveform {0 62.5} [list [get_pins {ClockBlock/imo}]]


# Component constraints for C:\Users\ailen\OneDrive\Documents\PSoC Creator\Workspace01\CapSenseDesign_freeRTOS.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Users\ailen\OneDrive\Documents\PSoC Creator\Workspace01\CapSenseDesign_freeRTOS.cydsn\CapSenseDesign_freeRTOS.cyprj
# Date: Thu, 30 Nov 2023 20:35:36 GMT
